#include <iostream>
#include <vector>

using namespace std;

int main()
{
    // Task 1
    {
        vector<int> A = {3, 55, 7, 5, 8, 5};  // Вхідний вектор
        int P = 5;  // Шукаємо це значення
        int index;  // Змінна для збереження індексу першого входження

        // Проходимо по вектору і знаходимо перше входження P
        for (int i = 0; i < A.size(); ++i) {
            if (A[i] == P) {
                index = i;
                break;  // Зупиняємо цикл після знаходження першого входження
            }
        }

        // Виводимо результат
        if (index != 0) {
            cout << "Індекс першого входження " << P << " у вектор: " << index << endl;
        } else {
            cout << "Значення " << P << " не знайдено у векторі." << endl;
        }

    }

    // Task 2
    {
        vector<int> A = {-3, -1, 7, -5, -8, 0, -2, -3};  // Вхідний вектор
    int min_positive = 0;  // Ініціалізуємо значенням 0, яке означає, що додатних значень ще не знайдено

    // Проходимо по вектору, шукаємо найменший додатний елемент
    for (int i = 0; i < A.size(); ++i) {
        if (A[i] > 0) {
            // Якщо це перший додатний елемент або він менший за поточний мінімум
            if (min_positive == 0 || A[i] < min_positive) {
                min_positive = A[i];
            }
        }
    }

    // Виводимо результат
    if (min_positive != 0) {
        cout << "Найменше додатне значення у векторі: " << min_positive << endl;
    } else {
        cout << "У векторі немає додатних значень." << endl;
    }
    }

    // Task 3
    {
        
    }

}


