#include <iostream>
//#include <vector> // цей рядок закоментований, оскільки я думала використовувати бібліотеку vector
using namespace std;

// функція, що перевіряє, чи відповідає рядок певному формату
// формат такий: рядок починається з '(' і закінчується ')', 
// а між ними мають бути великі латинські літери (A-Z), розділені комами
bool checkLang(string str) {
    bool result = true; // ініціалізуємо змінну result TRUE/FALSE

    // перевіряємо перший символ, який має бути відкриваючою дужкою '('
    if (str[0] == '(') {
        result = true; //диввимось і, якщо перший символ — '(', продовжуємо перевірку
    }
    else {
        return false; // якщо перший символ не '(', одразу повертаємо false
    }

    // цикл для перевірки символів від 1-го до передостаннього в рядку (останній — це ')')
    for (int i = 1; (i < str.size() - 1 && result); i++) {

        // якщо поточний символ — літера з діапазону A-Z
        if (str[i] >= 'A' && str[i] <= 'Z') {
            // перевіряємо, що наступний символ є комою, або закриваючою дужкою ')'
            if ((str[i + 1] == ',') || (str[i + 1] == ')')) {
                result = true; // якщо умова виконується, то продовжуємо перевірку
            }
            else {
                return false; // якщо після букви не кома і не ')', рядок не відповідає формату
            }
        }
        // якщо поточний символ кома
        else if (str[i] == ',') {
            // перевіряємо, що після коми йде літера з діапазону A-Z
            if (str[i + 1] >= 'A' && str[i + 1] <= 'Z') {
                result = true; // якщо все добре, продовжуємо перевірку
            }
            else {
                return false; // якщо після коми не літера, рядок не відповідає заданому формату
            }
        }
        else {
            return false; // якщо символ не літера і не кома, рядок не відповідає формату
        }
    }

    return result; // повертаємо результат перевірки
}

int main()
{
    string one = "(A,S,D)"; // тестовий рядок (формат правильний) має вивестись значення TRUE 1
    string two = "(15)"; // Тестовий рядок: (містить числа, неправильний формат) має вивестись значення FALSE 0
    string three = "(ABC)"; // Тестовий рядок: (немає ком, але всі літери великі, правильний формат) має вивестись значення TRUE 1

    // виводимо результат перевірки кожного рядка
    cout << checkLang(one) << endl;  // має вивести 1  TRUE
    cout << checkLang(two) << endl;  // має вивести 0 FALSE
    cout << checkLang(three) << endl;  // має вивести 1 TRUE

    return 0;
}
